#+title: My Emacs Configuration
#+AUTHOR: =Dang Quang Vu=
#+EMAIL: jayden@openedu101.com
#+SUBTITLE: Emacs configuration for work and life
#+property: header-args:emacs-lisp :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle ./init.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export

*** Babel
One of the amazing features of org-mode is its literary programming capacities
by running code blocks from within Org-mode itself. But for that, only a couple
of languages are supported directly by Org-mode itself, and they need to be
activated. Here are the languages I activated in my Org-mode configuration:
#+NAME: org-babel-languages-table
| C          |
| emacs-lisp |
| gnuplot    |
| latex      |
| makefile   |
| restclient |
| js         |
| plantuml   |
| python     |
| sass       |
| shell      |
| sql        |

#+NAME: org-babel-languages-gen
#+header: :cache yes :results replace
#+header: :var languages=org-babel-languages-table[,0]
#+BEGIN_SRC emacs-lisp :exports none :tangle no
(format "'(%s)"
        (mapconcat (lambda ($language)
                     (format "(%s . t)" $language))
                   languages
                   "\n  "))
#+END_SRC

#+RESULTS[4f5f1e3b7e6c7deff167ce33bc7d4c6c2c52d873]: org-babel-languages-gen
#+begin_example
'((C . t)
  (emacs-lisp . t)
  (gnuplot . t)
  (latex . t)
  (makefile . t)
  (js . t)
  (plantuml . t)
  (restclient . t)
  (python . t)
  (sass . t)
  (shell . t)
  (sql . t))
#+end_example

The corresponding code is as follows:
#+NAME: org-babel-load-languages
#+BEGIN_SRC emacs-lisp :noweb yes :tangle no
(org-babel-do-load-languages
 'org-babel-load-languages
 <<org-babel-languages-gen()>>)
#+END_SRC

Some languages can run asynchronously with the help of ~ob-async~.
#+begin_src emacs-lisp
(use-package ob-async
  :straight (:build t)
  :defer t
  :after (org ob))
#+end_src

A package I use from time to time is ~ob-latex-as-png~ which allows me to easily convert a LaTeX snippet into a PNG, regardless of the exporter I use afterwards. Its installation is pretty simple:
#+begin_src emacs-lisp
(use-package ob-latex-as-png
  :after org
  :straight (:build t))
#+end_src

A nice thing to have when working with REST APIs is to have a REST client. Even better if it can work inside org-mode!
#+begin_src emacs-lisp
(use-package restclient
  :straight (:build t)
  :defer t)

(use-package ob-restclient
  :straight (:build t)
  :defer t
  :after (org ob)
  :init
  (add-to-list 'org-babel-load-languages '(restclient . t)))
#+end_src

*** Capture
Org capture is an amazing tool for taking quick notes, be it simple text, links, resources, or reminders. They are all organised is specified org files which are described below.
#+name: org-capture-target-files
#+begin_src emacs-lisp :tangle no
(defvar org-personal-file "~/Dropbox/Org/Personal.org")
(defvar org-vocabulary-file "~/Dropbox/Org/Vocabulary.org")
#+end_src

Let me describe a keybind to invoke org-capture from anywhere within Emacs.
#+name: org-capture-keybinds
#+begin_src emacs-lisp :tangle no
(dqv/leader-key
  :packages 'org
  :infix "o"
  ""  '(:ignore t :which-key "org")
  "c" #'org-capture)
#+end_src

When ~org-capture~ is invoked, it will ask which template we wish to use. In the table [[org-capture-shortcuts-table]], the /key/ column represents which keychord we need to hit, titled with /name/, we need to hit in order to use the /template/, inserted in the designated /file/ in the manner described by /insertion mode/.
#+name: org-capture-shortcuts-table
| Shortcut | Name       | Title | Insertion mode | file                | template              |
|----------+------------+-------+----------------+---------------------+-----------------------|
| p        | Personal   |       | file+headline  | org-personal-file   | schedule.orgcaptmpl   |
| v        | Vocabulary |       |                | org-vocabulary-file | vocabulary.orgcaptmpl |

#+name: org-capture-shortcuts-gen
#+header: :exports none :cache yes :tangle no
#+begin_src emacs-lisp :var entries=org-capture-shortcuts-table
(mapconcat (lambda (entry)
             (let ((key      (nth 0 entry))
                   (name     (nth 1 entry))
                   (title    (nth 2 entry))
                   (ins-mode (nth 3 entry))
                   (file     (nth 4 entry))
                   (template (nth 5 entry)))
               (if (string= "" ins-mode)
                   (format "%S" `(,key ,name))
                 (format "(\"%s\" \"%s\" entry\n  %S\n  %S)"
                         key name
                         `(,(intern ins-mode) ,(intern file) ,(if (string= "file+datetree" ins-mode)
                                                                  (intern "")
                                                                (if (string= title "")
                                                                    name
                                                                  title)))
                         `(file ,(concat "~/.emacs.d/capture/" template))))))
           entries
           "\n")
#+end_src

#+RESULTS[7643b4af0bad2d5e1349d3722e8c5348fe77bb81]: org-capture-shortcuts-gen
#+begin_example
("a" "Archive")
("aw" "Web" entry
  (file+headline org-archive-file "Websites")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("ar" "Research" entry
  (file+headline org-archive-file "Research")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("aq" "Quote" entry
  (file+headline org-archive-file "Quote")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("ad" "Development" entry
  (file+headline org-archive-file "Development")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("i" "Ideas" entry
  (file+headline org-archive-file "Ideas")
  (file "~/.emacs.d/capture/ideas.orgcaptmpl"))
("j" "Journal" entry
  (file+headline org-journal-file "Journal")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("t" "Training" entry
  (file+headline org-training-file "Training")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("s" "Study" entry
  (file+headline org-study-file "Study")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("v" "Vocabulary" entry
  (file+headline org-vocabulary-file "Vocabulary")
  (file "~/.emacs.d/capture/vocabulary.orgcaptmpl"))
("St" "Tiktok" entry
  (file+headline org-social-file "Tiktok")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("ST" "Tweeter" entry
  (file+headline org-social-file "Tweeter")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("Sl" "Linkedin" entry
  (file+headline org-social-file "Linkedin")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("Sb" "Blog" entry
  (file+headline org-social-file "Posts")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("w" "Work" entry
  (file+headline org-work-file "Work")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
("p" "Personal" entry
  (file+headline org-personal-file "Personal")
  (file "~/.emacs.d/capture/schedule.orgcaptmpl"))
#+end_example

The capture templates are set like so:
#+name: org-capture-templates
#+begin_src emacs-lisp :tangle no :results silent
(setq org-capture-templates
      '(
        <<org-capture-shortcuts-gen()>>))
#+end_src

